apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxq_pinmap.h
#define GPIO_COMP1_OUT_1               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_COMP1_OUT_2               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_COMP1_OUT_3               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_COMP1_OUT_4               (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_COMP1_OUT_5               (GPIO_ALT | GPIO_AF2 | GPIO_PORTF | GPIO_PIN4)

#define GPIO_COMP2_OUT_1               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_COMP2_OUT_2               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_COMP2_OUT_3               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_COMP2_OUT_4               (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN9)

#define GPIO_COMP3_OUT_1               (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_COMP3_OUT_2               (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_COMP3_OUT_3               (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN2)

#define GPIO_COMP4_OUT_1               (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_COMP4_OUT_2               (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_COMP4_OUT_3               (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN14)

#define GPIO_COMP5_OUT_1               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_COMP5_OUT_2               (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN7)

#define GPIO_COMP6_OUT_1               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_COMP6_OUT_2               (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN6)

#define GPIO_COMP7_OUT_1               (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_COMP7_OUT_2               (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN8)

/* CRS **********************************************************************/

/* REVISIT: Clock Recovery System (CRS_SYNC signal exposed to pin(s)?)
 * Before using the following defines, make sure they are correct!
 */

#if 0
#  define GPIO_USB_CRS_SYNC_0          (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN10)
#  define GPIO_UCPD1_CRS_SYNC_0        (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN3)
#endif

/* DAC **********************************************************************/

#define GPIO_DAC1_OUT1_0               (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN4)
#define GPIO_DAC1_OUT2_0               (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN5)
#define GPIO_DAC2_OUT1_0               (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN6)

/* Clocks outputs ***********************************************************/

/* MCU clock output */

#define GPIO_MCO_1                     (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_MCO_2                     (GPIO_ALT | GPIO_AF0 | GPIO_PORTG | GPIO_PIN10)

/* Event outputs ************************************************************/

#define GPIO_PA0_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_PA1_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_PA2_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_PA3_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_PA4_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_PA5_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_PA6_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_PA7_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_PA8_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_PA9_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_PA10_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_PA11_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_PA12_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_PA13_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN13)
#define GPIO_PA14_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN14)
#define GPIO_PA15_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTA | GPIO_PIN15)

#define GPIO_PB0_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_PB1_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_PB2_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_PB3_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_PB4_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_PB5_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_PB6_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_PB7_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_PB8_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_PB9_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_PB10_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_PB11_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN11)
#define GPIO_PB12_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_PB13_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_PB14_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_PB15_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTB | GPIO_PIN15)

#define GPIO_PC0_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_PC1_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_PC2_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_PC3_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_PC4_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN4)
#define GPIO_PC5_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN5)
#define GPIO_PC6_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_PC7_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_PC8_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_PC9_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_PC10_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_PC11_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_PC12_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_PC13_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN13)
#define GPIO_PC14_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN14)
#define GPIO_PC15_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTC | GPIO_PIN15)

#define GPIO_PD0_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_PD1_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_PD2_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_PD3_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_PD4_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_PD5_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN5)
#define GPIO_PD6_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_PD7_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_PD8_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN8)
#define GPIO_PD9_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_PD10_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_PD11_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_PD12_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_PD13_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_PD14_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN14)
#define GPIO_PD15_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTD | GPIO_PIN15)

#define GPIO_PE0_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN0)
#define GPIO_PE1_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN1)
#define GPIO_PE2_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_PE3_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_PE4_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_PE5_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_PE6_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_PE7_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN7)
#define GPIO_PE8_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_PE9_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_PE10_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_PE11_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_PE12_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_PE13_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_PE14_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_PE15_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN15)

#define GPIO_PF0_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN0)
#define GPIO_PF1_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN1)
#define GPIO_PF2_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN2)
#define GPIO_PF3_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN3)
#define GPIO_PF4_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN4)
#define GPIO_PF5_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN5)
#define GPIO_PF6_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN6)
#define GPIO_PF7_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN7)
#define GPIO_PF8_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN8)
#define GPIO_PF9_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN9)
#define GPIO_PF10_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN10)
#define GPIO_PF11_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN11)
#define GPIO_PF12_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN12)
#define GPIO_PF13_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN13)
#define GPIO_PF14_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN14)
#define GPIO_PF15_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN15)

#define GPIO_PG0_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN0)
#define GPIO_PG1_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN1)
#define GPIO_PG2_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN2)
#define GPIO_PG3_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN3)
#define GPIO_PG4_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN4)
#define GPIO_PG5_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN5)
#define GPIO_PG6_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_PG7_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_PG8_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_PG9_EVENTOUT_0            (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_PG10_EVENTOUT_0           (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN10)

/* FDCAN ********************************************************************/

#define GPIO_FDCAN1_RX_1               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN11)
#define GPIO_FDCAN1_RX_2               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN8)
#define GPIO_FDCAN1_RX_3               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN0)
#define GPIO_FDCAN1_TX_1               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN12)
#define GPIO_FDCAN1_TX_2               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN9)
#define GPIO_FDCAN1_TX_3               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN1)

#define GPIO_FDCAN2_RX_1               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN5)
#define GPIO_FDCAN2_RX_2               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN12)
#define GPIO_FDCAN2_TX_1               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_FDCAN2_TX_2               (GPIO_ALT | GPIO_AF9 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN13)

#define GPIO_FDCAN3_RX_1               (GPIO_ALT | GPIO_AF11 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN8)
#define GPIO_FDCAN3_RX_2               (GPIO_ALT | GPIO_AF11 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN3)
#define GPIO_FDCAN3_TX_1               (GPIO_ALT | GPIO_AF11 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN15)
#define GPIO_FDCAN3_TX_2               (GPIO_ALT | GPIO_AF11 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN4)

/* FMC/FSMC - Flexible Static Memory Controller *****************************/

#define GPIO_FMC_A0_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN10)
#define GPIO_FMC_A1_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN7)
#define GPIO_FMC_A2_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN2)
#define GPIO_FMC_A3_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN3)
#define GPIO_FMC_A4_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN4)
#define GPIO_FMC_A5_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN5)
#define GPIO_FMC_A6_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN12)
#define GPIO_FMC_A7_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN13)
#define GPIO_FMC_A8_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN14)
#define GPIO_FMC_A9_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN15)
#define GPIO_FMC_A10_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN0)
#define GPIO_FMC_A11_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN1)
#define GPIO_FMC_A12_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN2)
#define GPIO_FMC_A13_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN3)
#define GPIO_FMC_A14_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN4)
#define GPIO_FMC_A15_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN5)
#define GPIO_FMC_A16_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_FMC_A17_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_FMC_A18_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN13)
#define GPIO_FMC_A19_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_FMC_A20_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_FMC_A21_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_FMC_A22_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_FMC_A23_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_FMC_A24_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN8)
#define GPIO_FMC_A25_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN9)
#define GPIO_FMC_CLK_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_FMC_D0_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN14)
#define GPIO_FMC_D1_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN15)
#define GPIO_FMC_D2_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_FMC_D3_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_FMC_D4_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN7)
#define GPIO_FMC_D5_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_FMC_D6_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_FMC_D7_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_FMC_D8_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_FMC_D9_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_FMC_D10_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_FMC_D11_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_FMC_D12_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN15)
#define GPIO_FMC_D13_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN8)
#define GPIO_FMC_D14_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_FMC_D15_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_FMC_DA0_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN14)
#define GPIO_FMC_DA1_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN15)
#define GPIO_FMC_DA2_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN0)
#define GPIO_FMC_DA3_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN1)
#define GPIO_FMC_DA4_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN7)
#define GPIO_FMC_DA5_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_FMC_DA6_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_FMC_DA7_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_FMC_DA8_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_FMC_DA9_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_FMC_DA10_0                (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_FMC_DA11_0                (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_FMC_DA12_0                (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN15)
#define GPIO_FMC_DA13_0                (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN8)
#define GPIO_FMC_DA14_0                (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN9)
#define GPIO_FMC_DA15_0                (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_FMC_INT_1                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_FMC_INT_2                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_FMC_NBL0_0                (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN0)
#define GPIO_FMC_NBL1_0                (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTE | GPIO_PIN1)
#define GPIO_FMC_NCE_1                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_FMC_NCE_2                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_FMC_NE1_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_FMC_NE2_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_FMC_NE3_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_FMC_NE4_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTF | GPIO_PIN11)
#define GPIO_FMC_NL_0                  (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_FMC_NOE_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_FMC_NWAIT_0               (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN6)
#define GPIO_FMC_NWE_0                 (GPIO_ALT | GPIO_PULLUP | GPIO_AF12 | GPIO_PORTD | GPIO_PIN5)

/* HRTIM - High-Resolution Timer ********************************************/

